<?php

/**
 * Абстракный класс, который содержит общую логику для всех остальных контроллеров админ панели
 */
abstract class AdminBase
{

    /**
     * Метод для проверки прав доступа для админ панели
     * @return bool
     */
    public static function checkAdmin()
    {
        // Проверяем, авторизирован ли юзер, если нет, то переадресовываем
        $userId = User::checkLogged();

        // Получаем информацию о текущем пользователе
        $user = User::getUserById($userId);

        // Если пользователь обладает правами доступа, то пускаем его в админку
        if ($user['role'] == 'admin') {
            return true;
        }

        // Если нет, то завершаем работу и выводим сообщение
        die('Доступ запрещен');
    }
}